import React from 'react';
import '../App.css';

function MyFuture() {
  return (
    <div className="container">
      <div className="card">
        <h1>🌱 Мої плани</h1>
        <ol>
          <li> Завершити курс з аналізу данних 🔧</li>
          <li>Розробити свої перші проекти 🎓 </li>
          <li>Створити портфоліо 💼 </li>
          <li>Знайти першу роботу в ІТ 🧠 </li>
          <li>Продовжувати розвиватися в цій сфері та створювати масштабні проекти 🌍 </li>
        </ol>
      </div>

      <div className="card quote-card">
        <h2>💬 Мотиваційна цитата</h2>
        <blockquote>
          “Велика мандрівка починається з першого кроку.”
          <br />
          <span className="quote-author">— Лао-цзи</span>
        </blockquote>
      </div>

      <div className="card">
        <h2>💻 Робота мрії</h2>
        <p>
        Чесно кажучи моєю роботою мріїї буде робота пов'язана зі штучним інтелектом.
        На даний момент ідеальною я вважаю професію науковця даних.
        Згідно цієї посади, я буду обробляти дані, створювати відповідні моделі машинного навчання на базі ШІ, щоб полегшувати аналіз інформації, працювати у великій команді.
        Я дійсно прагну досягнути успіху у цій сфері, хоча можливо я стану розробником моделей зі штучним інтелектом.
        Усе ж таки я вважаю, що ШІ повністю змінить світ і за ним успіх.
        </p>
        <img src="/pics/робота.jpg" alt="робота мрії" style={{ width: '80%', maxWidth: '600px', borderRadius: '10px', margin: 'auto', display: 'block' }} />
      </div>

      <div className="card">
        <h2>🛠 Що я роблю зараз?</h2>
        <p>
        Зараз я активно вивчаю нові технології, беру участь у невеликих проєктах і створюю портфоліо.
        Також читаю статті, проходжу курси на YouTube та практикуюся на платформах.
        Знайшла сайт, де можна приймати участь у змаганнях з створення різних моделей МН, коли я буду вміти і знати більше обов'язково прийму участь!
        </p>
      </div>

      <div className="card future-vision">
        <h2>🚀 Якою я бачу себе через 5 років?</h2>
        <p>
        Через 5 років я бачу себе частиною міжнародної команди, що працює над масштабними даними, створенням моделей.
        До цього часу я буду мати достатньо багато проектів, пристойну зарплату, хорошу команду, можливо, одну з керівних посад та думаю колись я зможу створити свою ІТ-компанію. 
        Головне - не втрачати мотивацію та працювати над дисципліною і все буде як у мріях!
        </p>
      </div>
    </div>
  );
}

export default MyFuture;
